---
kind: property
id: P:Autodesk.Revit.DB.CurtainGrid.NumVLines
source: html/f5fa1b81-3209-ec84-0e07-21ae7cf9c893.htm
---
# Autodesk.Revit.DB.CurtainGrid.NumVLines Property

Get the number of grid lines in the V direction.

## Syntax (C#)
```csharp
public int NumVLines { get; }
```